OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f86j94.h
extern __at(0x0EB6) volatile __LCDDATA40bits_t LCDDATA40bits;

#define _S00C5                  0x01
#define _S01C5                  0x02
#define _S02C5                  0x04
#define _S03C5                  0x08
#define _S04C5                  0x10
#define _S05C5                  0x20
#define _S06C5                  0x40
#define _S07C5                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA41 Bits

extern __at(0x0EB7) __sfr LCDDATA41;

typedef struct
  {
  unsigned S08C5                : 1;
  unsigned S09C5                : 1;
  unsigned S10C5                : 1;
  unsigned S11C5                : 1;
  unsigned S12C5                : 1;
  unsigned S13C5                : 1;
  unsigned S14C5                : 1;
  unsigned S15C5                : 1;
  } __LCDDATA41bits_t;

extern __at(0x0EB7) volatile __LCDDATA41bits_t LCDDATA41bits;

#define _S08C5                  0x01
#define _S09C5                  0x02
#define _S10C5                  0x04
#define _S11C5                  0x08
#define _S12C5                  0x10
#define _S13C5                  0x20
#define _S14C5                  0x40
#define _S15C5                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA42 Bits

extern __at(0x0EB8) __sfr LCDDATA42;

typedef struct
  {
  unsigned S16C5                : 1;
  unsigned S17C5                : 1;
  unsigned S18C5                : 1;
  unsigned S19C5                : 1;
  unsigned S20C5                : 1;
  unsigned S21C5                : 1;
  unsigned S22C5                : 1;
  unsigned S23C5                : 1;
  } __LCDDATA42bits_t;

extern __at(0x0EB8) volatile __LCDDATA42bits_t LCDDATA42bits;

#define _S16C5                  0x01
#define _S17C5                  0x02
#define _S18C5                  0x04
#define _S19C5                  0x08
#define _S20C5                  0x10
#define _S21C5                  0x20
#define _S22C5                  0x40
#define _S23C5                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA43 Bits

extern __at(0x0EB9) __sfr LCDDATA43;

typedef struct
  {
  unsigned S24C5                : 1;
  unsigned S25C5                : 1;
  unsigned S26C5                : 1;
  unsigned S27C5                : 1;
  unsigned S28C5                : 1;
  unsigned S29C5                : 1;
  unsigned S30C5                : 1;
  unsigned S31C5                : 1;
  } __LCDDATA43bits_t;

extern __at(0x0EB9) volatile __LCDDATA43bits_t LCDDATA43bits;

#define _S24C5                  0x01
#define _S25C5                  0x02
#define _S26C5                  0x04
#define _S27C5                  0x08
#define _S28C5                  0x10
#define _S29C5                  0x20
#define _S30C5                  0x40
#define _S31C5                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA44 Bits

extern __at(0x0EBA) __sfr LCDDATA44;

typedef struct
  {
  unsigned S32C5                : 1;
  unsigned S33C5                : 1;
  unsigned S34C5                : 1;
  unsigned S35C5                : 1;
  unsigned S36C5                : 1;
  unsigned S37C5                : 1;
  unsigned S38C5                : 1;
  unsigned S39C5                : 1;
  } __LCDDATA44bits_t;

extern __at(0x0EBA) volatile __LCDDATA44bits_t LCDDATA44bits;

#define _S32C5                  0x01
#define _S33C5                  0x02
#define _S34C5                  0x04
#define _S35C5                  0x08
#define _S36C5                  0x10
#define _S37C5                  0x20
#define _S38C5                  0x40
#define _S39C5                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA45 Bits

extern __at(0x0EBB) __sfr LCDDATA45;

typedef struct
  {
  unsigned S40C5                : 1;
  unsigned S41C5                : 1;
  unsigned S42C5                : 1;
  unsigned S43C5                : 1;
  unsigned S44C5                : 1;
  unsigned S45C5                : 1;
  unsigned S46C5                : 1;
  unsigned S47C5                : 1;
  } __LCDDATA45bits_t;

extern __at(0x0EBB) volatile __LCDDATA45bits_t LCDDATA45bits;

#define _S40C5                  0x01
#define _S41C5                  0x02
#define _S42C5                  0x04
#define _S43C5                  0x08
#define _S44C5                  0x10
#define _S45C5                  0x20
#define _S46C5                  0x40
#define _S47C5                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA46 Bits

extern __at(0x0EBC) __sfr LCDDATA46;

typedef struct
  {
  unsigned S48C5                : 1;
  unsigned S49C5                : 1;
  unsigned S50C5                : 1;
  unsigned S51C5                : 1;
  unsigned S52C5                : 1;
  unsigned S53C5                : 1;
  unsigned S54C5                : 1;
  unsigned S55C5                : 1;
  } __LCDDATA46bits_t;

extern __at(0x0EBC) volatile __LCDDATA46bits_t LCDDATA46bits;

#define _S48C5                  0x01
#define _S49C5                  0x02
#define _S50C5                  0x04
#define _S51C5                  0x08
#define _S52C5                  0x10
#define _S53C5                  0x20
#define _S54C5                  0x40
#define _S55C5                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA47 Bits

extern __at(0x0EBD) __sfr LCDDATA47;

typedef struct
  {
  unsigned S56C5                : 1;
  unsigned S57C5                : 1;
  unsigned S58C5                : 1;
  unsigned S59C5                : 1;
  unsigned S60C5                : 1;
  unsigned S61C5                : 1;
  unsigned S62C5                : 1;
  unsigned S63C5                : 1;
  } __LCDDATA47bits_t;

extern __at(0x0EBD) volatile __LCDDATA47bits_t LCDDATA47bits;

#define _S56C5                  0x01
#define _S57C5                  0x02
#define _S58C5                  0x04
#define _S59C5                  0x08
#define _S60C5                  0x10
#define _S61C5                  0x20
#define _S62C5                  0x40
#define _S63C5                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA48 Bits

